import { Category } from "../app/components/organisms/Navbar/Navbsr.type";

export const categories: Category[] = [
    {
      id: "1",
      name: "برندها",
      subcategories: 
        [
          {
            id: "1-1",
            name: "همه برندها",
            items: ["آبریژن","آبان", "فولیکا", "آردن"],
          }
      ]
    },
    {
      id: "2",
    name: "آرایشی",
    subcategories: [
      {
        id: "2-1",
        name: "آرایش صورت",
        items: [" کانسیلر", "پرایمر", "پنکیک"],
      },
      {
        id: "2-2",
        name: "آرایش چشم",
        items: ["سایه چشم", "خط چشم", "ریمل"],
      },
      {
        id: "2-3",
        name: "آرایش لب",
        items: ["رژ لب", "تینت لب", "خط لب"],
      },
    ],
    },
    {
      id: "3",
      name: "مراقبت مو و زیبایی",
      subcategories: 
        [
          {
            id: "3-1",
            name: "شامپو",
            items: ["آبریژن","آبان", "فولیکا", "آردن"],
          },
          {
            id: "3-2",
            name: "مراقبت از مو",
            items: ["نرم‌کننده مو","روغن مو", "سرم مو", "ماسک مو"],
          }
      ]
    },
    {
      id: "4",
      name: "بهداشت شخصی و حمام",
      subcategories: 
        [
          {
            id: "4-1",
            name: "لوازم اصلاح",
            items: [ "لوازم اصلاح مردانه", "لوازم اصلاح زنانه"],
          },
          {
            id: "4-2",
            name: "بهداشت دهان و دندان",
            items: ["خمیردندان","نخ دندان", "دهان شویه", "مسواک"],
          }
      ]
    },
    {
      id: "5",
      name: "اسپری و ادکلن",
      subcategories: 
        [
          {
            id: "5-1",
            name: "ادکلن",
            items: [ "ادکلن مردانه", "ادکلن زنانه"],
          },
          {
            id: "5-2",
            name: "اسپری بدن",
            items: [ "اسپری مردانه", "اسپری زنانه"],
          }
      ]
    }
  ];